// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "컴퓨터에 스캔";

// Restore alert message
"RESTORE_TITLE" = "설정을 복구하시겠습니까?";
"RESTORE_MSG" = "이 작업을 수행하면 모든 스캔 바로 가기가 원래 상태로 복구됩니다. 바로 가기를 바뀌지 않은 상태로 두려면 [취소]를 누르고 초기 기본 설정으로 되돌리려면 [복구]를 누르십시오.";
"RESTORE_BUTTON_TITLE" = "복구";

"DEFAULT_TASK_CAPTION" = "작업 이름:";
"DONE" = "완료";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "작업 사용할 수 없음";
"TASK_NOT_FOUND_DESC" = "장치에서 탐지된 “%@” 작업은 사용자의 시스템에서 수행할 수 없습니다. 다른 작업을 선택하십시오.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "워크플로 복사 실패";
"COPY_WORKFLOWS_DESC" = "워크플로를 사용자 장치 도메인 폴더에 복사하는 데 실패하였습니다.";

"DEVICE_NOT_FOUND_TITLE" = "장치를 찾을 수 없음";
"DEVICE_NOT_FOUND_DESC" = "장치와 통신하는 데 문제가 발생했습니다. 장치가 켜져 있고 올바로 연결되어 있는지 확인한 후에 다시 시도하십시오.";

"COMPUTER_NAME_INFO_TITLE" = "“컴퓨터 이름” 필드는 HP 장치에 표시될 컴퓨터의 이름을 입력하는 곳입니다."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "입력할 수 있는 글자 수는 사용하는 장치에 따라 다릅니다.";

"UNKNOWN_ERROR_TITLE" = "알 수 없는 오류";
"UNKNOWN_ERROR_DESC" = "장치를 업데이트하는 도중에 알 수 없는 오류가 발생하였습니다. 장치의 전원이 켜져 있는지, 올바르게 연결되었는지 확인하십시오.";

"OK" = "승인";
"CANCEL" = "취소";

"MOREINFO_TITLE" = "추가 정보";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "스캔 바로 가기 관리자"; // Title
"SSM_SHORT_DESC" = "스캔 바로 가기를 사용하면 HP 장치의 전면 패널의 컨트롤을 사용하는 일반 스캔 작업을 수행할 수 있습니다."; // short description
"YOUR_COMPUTER_NAME" = "컴퓨터 이름:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "변경...";
"MORE_INFO_BTN_TITLE" = "추가 정보...";
"RESTORE_BTN_TITLE" = "기본값 복구";
"TEST_BTN_TITLE" = "테스트...";
"EDIT_BTN_TITLE" = "편집...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "“%@” 폴더에 대한 액세스 권한이 없습니다. 액세스 권한을 보거나 변경하려면 Finder에서 항목을 선택한 다음 File > Get Info를 선택합니다."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "오류";
"ERROR_UNKNOWN_DESC" = "알 수 없는 오류가 발생했습니다.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "바로 가기 없음";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "%2$@ 장치의 %1$@ 바로 가기가 없습니다. 소프트웨어를 다시 설치하십시오.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "워크플로우 생성 실패";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "워크플로우를 생성하는 중에 알 수 없는 오류가 발생하였습니다. 다시 시도하십시오.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "디렉터리 생성 오류";
"ERROR_CREATING_DIR_DESC" = "%@ 디렉터리 생성 오류가 발생했습니다. 상위 폴더 액세스 권한을 확인하고 다시 시도하십시오.";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Automator에서 워크플로우 “%@”을(를) 여는 중에 오류가 발생했습니다. 원본 위치에서 해당 워크플로우를 찾을 수 없습니다.";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "스캔 바로 가기가 지원되지 않음";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "스캔 바로 가기를 소프트웨어에서 인식하지 못했기 때문에 선택한 스캔 바로 가기를 실행할 수 없습니다. 다른 스캔 바로 가기를 선택하고 다시 시도하십시오.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "컴퓨터 이름을 변경하려면 누릅니다.";
"TIP_FOR_EDIT_BTN" = "선택한 작업을 편집합니다.";
"TIP_FOR_TEST_BTN" = "선택한 작업을 실행합니다.";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "컴퓨터 이름:";
"COMPUTER_NAME_DESCRIPTION" = "HP 장치에서 스캔을 시작할 때 '컴퓨터로 스캔'이 활성화된 호스트 컴퓨터 목록에서 사용자의 컴퓨터를 선택하라는 메시지가 나타납니다.";
"COMPUTER" = "컴퓨터";
"COMPUTERS" = "컴퓨터";

"COMMUNICATION_ERROR" = "스캐너 통신을 설정할 수 없습니다. 장치가 켜져 있고 연결되어 있는지 확인하고 네트워크가 정상인지도 확인합니다. 장치에서 Bonjour가 반드시 활성화되어 있어야 합니다.";
"INSTALLATION_ERROR" = "컴퓨터에 스캔에 필요한 HP 소프트웨어가 컴퓨터에 설치되어 있지 않습니다. http://www.hp.com/support에서 HP가 권장하는 최신 소프트웨어를 다운로드 및 설치한 후 다시 시도하십시오.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "'컴퓨터에 스캔'을 활성화할 수 없습니다.";
"SCAN_TO_COMPUTER_DESCRIPTION" = "HP 장치의 전면 패널에서 '컴퓨터에 스캔'을 사용하면 스캔을 시작하고 자동으로 컴퓨터에 출력 결과를 보냅니다.";

HSDScanActionNotFoundTitle = "스캔 작업을 찾을 수 없음";
HSDScanActionNotFoundDescription = "스캔 작업이 등록되지 않았습니다. 자동으로 스캔 작업을 등록하려면 '%@'에서 HP Scan 응용 프로그램을 실행합니다.";
